protocolli/spcoop/example/client/ValidazioneContenutiWS/files/notificaAggiornamentoUtenteWDL.xml

<?xml version="1.0" encoding="UTF-8"?>
   <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <soapenv:Body>
         <a:notificaAggiornamentoUtenteWDLRequest xmlns:a="http://openspcoop2.org/ValidazioneContenutiWS/Service/types">
            <a:aggiornamento-nominativo nomePrecedente="Mario Rossi">Mario Verdi</a:aggiornamento-nominativo>
            <a:indirizzo>viale Roma 26</a:indirizzo>
         </a:notificaAggiornamentoUtenteWDLRequest>
      </soapenv:Body>
   </soapenv:Envelope>
